#!/usr/bin/env python3
# -*- coding: utf-8 -*-

# Необходимо вести кортеж А из 10 элементов, найти сумму элементов,
# меньших по модулю 5, и вывести ее на экран. Использовать в программе
# вместо списков кортежи.

import sys


if __name__ == '__main__':
    # Ввести кортеж одной строкой.
    A = tuple(map(int, input("Введите кортеж из 10-ти элементов:").split()))
    # Проверить количество элементов кортежа.
    if len(A) != 10:
        print("Неверный размер кортежа", file=sys.stderr)
        exit(1)

    # Найти искомую сумму.
    s = 0
    for item in A:
        if abs(item) < 5:
            s += item

print("Сумма элементов меньше по модуль 5:", s)
